stanlytw/M2354-Crypto-Emulation/Emulation Code/Crypto/CRYPTO_ECC/key_pair_test.c
/**************************************************************************//**
 * @file     ecc.c
 * @version  V1.10
 * $Revision: 1 $
 * $Date: 16/07/28 3:38p $
 * @brief    ECC curve demo
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "NuMicro.h"
#include "crypto.h"
#include "ecc.h"


#define MAX_KEY_LEN     168

#define DO_TEST_P_192
#define DO_TEST_P_224
#define DO_TEST_P_256
#define DO_TEST_P_384
#define DO_TEST_P_521
#define DO_TEST_K_163
#define DO_TEST_K_233
#define DO_TEST_K_283
#define DO_TEST_K_409
#define DO_TEST_K_571
#define DO_TEST_B_163
#define DO_TEST_B_233
#define DO_TEST_B_283
#define DO_TEST_B_409
#define DO_TEST_B_571


typedef struct kp_tv_t
{
    char   curve[8];
    char   d[MAX_KEY_LEN];
    char   Qx[MAX_KEY_LEN];
    char   Qy[MAX_KEY_LEN];
}  KP_TV_T;

static const KP_TV_T _kp[] =
{
#ifdef DO_TEST_P_192
    {
        "P-192",
        "e5ce89a34adddf25ff3bf1ffe6803f57d0220de3118798ea",
        "8abf7b3ceb2b02438af19543d3e5b1d573fa9ac60085840f",
        "a87f80182dcd56a6a061f81f7da393e7cffd5e0738c6b245"
    },
    {
        "P-192",
        "7d14435714ad13ff23341cb567cc91198ff8617cc39751b2",
        "39dc723b19527daa1e80425209c56463481b9b47c51f8cbd",
        "432a3e84f2a16418834fabaf6b7d2341669512951f1672ad"
    },
    {
        "P-192",
        "12039a122de1725d8d0e369b2fb536f7a38414a67cf69a83",
        "eb7e6011e825eb9f0c19d7d8695cf8da5805bf1f86019cef",
        "59694469ad604f6b407a9cba3d696b33ff410a9357b34baa"
    },
    {
        "P-192",
        "c9000be980277861ba12aef988c4fcee9fcc7976cdb52c24",
        "5c066c35a41fa529e0c2f222b554dba8248ec5f8a5d97db9",
        "87d8232e5ee59c028b3d92879748096f6ae174acf08f86ca"
    },
    {
        "P-192",
        "33d3e07b943e37455588cff5e45ca817ae800a1302bb01e3",
        "7adb43a9da0f8cd12fab9b87f2e03c956810b4d239fb14c7",
        "651ec5a42a7787ab26fce3af2ed10255de0d229842334f09"
    },
    {
        "P-192",
        "e23b51e2a07e73e23ff3399978f537dfb2532af873d1ceae",
        "bd6b11dbf12b786e0a972eadd87ec45c29e1d92f4f1e5f2b",
        "32e821b746f3ebdb5919458b08601ca259bae36c25cf1529"
    },
    {
        "P-192",
        "59c9a7db3e58ee05cca57a26faa4e459605ca606bda62a9b",
        "e8f3af0e8d2d25f1b32f5f131f00c88ef807a33886106106",
        "3661a1803542e39c00634b8e3186a019dc39b151bd6bb6ae"
    },
    {
        "P-192",
        "36bf9605bfec53fcf22cb1e0cce77b40e41b092b3ae6d009",
        "8475e3b373cae91c8229b958a0238984aef5a9f4b6cd30a6",
        "ded68658891512f35e6c003beaf4475b628376c87d1083ba"
    },
    {
        "P-192",
        "6774fde78e05c49a819e8a15f375a5944e289abd615a9d59",
        "7fc1af2b7080521311a84e8894a09c954105ece28cd508aa",
        "5d09f61268d10bb1d6d27f1d7fb3d87fb79d032ad35ac691"
    },
    {
        "P-192",
        "ec08d03c8b42b1c79bfb3e8eb38b1553db63599a511dd5b9",
        "65c0b405cdcee79cdea70ad70cf303b4614f2406fd48ad3c",
        "f622c2bbc0443b9249e2f0a1d93b8364203458a2fa7d4264"
    },
#endif

#ifdef DO_TEST_P_224
    {
        "P-224",
        "e7c92383846a4e6887a10498d8eaca2bd0487d985bd7d3f92ce3ab30",
        "0a3682d2aaa4dd931bee042d32e95755507ab164b12f84843f4b7b96",
        "a6313a938eff7a293222e0e3c7b4c6132489b33255a61c3fc1ce2256"
    },
    {
        "P-224",
        "7f29534466bcb399777a0c7d3d4eff787d96db26ac3561f9d43cccd9",
        "d64ad34b097c4ff4ebee68f11f04e195ef0c7d123eb21c11f13a91ad",
        "d155b803686c3e2aefde4a626dba1e09722af3617aaf67ad59844b09"
    },
    {
        "P-224",
        "2ce71aafdad95b69fdda27f441b2f28da06db5d17adb468af3e351a0",
        "86e8c2c2078692b9308e6ad34e1dfc51a6676d3c8a4a5e7b3295876a",
        "7c83d5d358916a0d990be417da7879f7e05a1576a7942c1bc075c0d3"
    },
    {
        "P-224",
        "68736e34687ee8408917200baa0a30a87c3d1b2d04fe617c0ba212e9",
        "50990cc0d778df3c2b7fbc610e1b562a92632f98dfb799118f108e22",
        "b9bacfd53f09d5de324bb13b866c1062bb616b0aa000d304509d0a54"
    },
    {
        "P-224",
        "d6901df3d4020dae1132b6f4e028dbead231d1f3d53c8eb22d85a6d7",
        "fe90c3e6d3e8a67759fbac03ef656bdabaee8c32724d9ad59cd0e379",
        "f80833779516d2ff7b5f1dc2e46d5c635d3a361356b220ac19dc0511"
    },
    {
        "P-224",
        "7b9bc29a4e737d97af8b148b2a56f0a0dd22b8e69db10172ddcb8e59",
        "893e9480585b457b17b6b252e2f0c319c1fcf203558419e7c2edbfb5",
        "d11a2968026b5884b0fec07969b7524ee87e02ff3dff30359fa56cb1"
    },
    {
        "P-224",
        "c078ad3141b567848dc389c3eb1d6d6733929c73d6bcb94333805376",
        "cd2008a5f860d45eb249258b4708de54643d50c761885c21f204feb0",
        "72b480f1e2b4f57bd0ad56be3317edd7b8ecced650fa82576ea896b8"
    },
    {
        "P-224",
        "6140b0af79c0b92e938bc8a5fc2ccbd62b7e7825c1bb5c89d4434856",
        "f40ea8fb8e3c2815df388a4a0dde5390c6291c24e20eb61ebfcf9b79",
        "1fb6a9d6ccdcd1765d88b185ce1aef4fa32c3a3465d334dde2468aa3"
    },
    {
        "P-224",
        "30f4113572e0fb39209aad2698608bc47f8c0d8c1061e954f72bc805",
        "b73221c141720c43d50183e975b0b28825e2f7a792a59fe984b9ef44",
        "a694d0f15642b2dd12ca17852a284e04543f5949161085296d932e63"
    },
    {
        "P-224",
        "9c1005987043a7b8f41efcccf3ac3e413ef31938097d2ac8bee9ec8e",
        "3c47a265cdb7dd2ec7c3fb97d95fccd5ae0ee55e9efb3bef7bcdfc7a",
        "62c2e871d67133111f05540a7204f9ae0d023ed7738703238ec18d85"
    },
#endif

#ifdef DO_TEST_P_256
    {
        "P-256",
        "c9806898a0334916c860748880a541f093b579a9b1f32934d86c363c39800357",
        "d0720dc691aa80096ba32fed1cb97c2b620690d06de0317b8618d5ce65eb728f",
        "9681b517b1cda17d0d83d335d9c4a8a9a9b0b1b3c7106d8f3c72bc5093dc275f"
    },
    {
        "P-256",
        "710735c8388f48c684a97bd66751cc5f5a122d6b9a96a2dbe73662f78217446d",
        "f6836a8add91cb182d8d258dda6680690eb724a66dc3bb60d2322565c39e4ab9",
        "1f837aa32864870cb8e8d0ac2ff31f824e7beddc4bb7ad72c173ad974b289dc2"
    },
    {
        "P-256",
        "78d5d8b7b3e2c16b3e37e7e63becd8ceff61e2ce618757f514620ada8a11f6e4",
        "76711126cbb2af4f6a5fe5665dad4c88d27b6cb018879e03e54f779f203a854e",
        "a26df39960ab5248fd3620fd018398e788bd89a3cea509b352452b69811e6856"
    },
    {
        "P-256",
        "2a61a0703860585fe17420c244e1de5a6ac8c25146b208ef88ad51ae34c8cb8c",
        "e1aa7196ceeac088aaddeeba037abb18f67e1b55c0a5c4e71ec70ad666fcddc8",
        "d7d35bdce6dedc5de98a7ecb27a9cd066a08f586a733b59f5a2cdb54f971d5c8"
    },
    {
        "P-256",
        "01b965b45ff386f28c121c077f1d7b2710acc6b0cb58d8662d549391dcf5a883",
        "1f038c5422e88eec9e88b815e8f6b3e50852333fc423134348fc7d79ef8e8a10",
        "43a047cb20e94b4ffb361ef68952b004c0700b2962e0c0635a70269bc789b849"
    },
    {
        "P-256",
        "fac92c13d374c53a085376fe4101618e1e181b5a63816a84a0648f3bdc24e519",
        "7258f2ab96fc84ef6ccb33e308cd392d8b568ea635730ceb4ebd72fa870583b9",
        "489807ca55bdc29ca5c8fe69b94f227b0345cccdbe89975e75d385cc2f6bb1e2"
    },
    {
        "P-256",
        "f257a192dde44227b3568008ff73bcf599a5c45b32ab523b5b21ca582fef5a0a",
        "d2e01411817b5512b79bbbe14d606040a4c90deb09e827d25b9f2fc068997872",
        "503f138f8bab1df2c4507ff663a1fdf7f710e7adb8e7841eaa902703e314e793"
    },
    {
        "P-256",
        "add67e57c42a3d28708f0235eb86885a4ea68e0d8cfd76eb46134c596522abfd",
        "55bed2d9c029b7f230bde934c7124ed52b1330856f13cbac65a746f9175f85d7",
        "32805e311d583b4e007c40668185e85323948e21912b6b0d2cda8557389ae7b0"
    },
    {
        "P-256",
        "4494860fd2c805c5c0d277e58f802cff6d731f76314eb1554142a637a9bc5538",
        "5190277a0c14d8a3d289292f8a544ce6ea9183200e51aec08440e0c1a463a4e4",
        "ecd98514821bd5aaf3419ab79b71780569470e4fed3da3c1353b28fe137f36eb"
    },
    {
        "P-256",
        "d40b07b1ea7b86d4709ef9dc634c61229feb71abd63dc7fc85ef46711a87b210",
        "fbcea7c2827e0e8085d7707b23a3728823ea6f4878b24747fb4fd2842d406c73",
        "2393c85f1f710c5afc115a39ba7e18abe03f19c9d4bb3d47d19468b818efa535"
    },
#endif

#ifdef DO_TEST_P_384
    {
        "P-384",
        "5394f7973ea868c52bf3ff8d8ceeb4db90a683653b12485d5f627c3ce5abd8978fc9673d14a71d925747931662493c37",
        "fd3c84e5689bed270e601b3d80f90d67a9ae451cce890f53e583229ad0e2ee645611fa9936dfa45306ec18066774aa24",
        "b83ca4126cfc4c4d1d18a4b6c21c7f699d5123dd9c24f66f833846eeb58296196b42ec06425db5b70a4b81b7fcf705a0"
    },
    {
        "P-384",
        "9b90d800abc37df43536e0dc321d43e6aeb5317fcb5118a0e827c8165b1cb05051ef12794b5278a293accbc0b1beb2c2",
        "732b0f83d303475584d88ed91cc74b367e9ffbfcc2d044d1485417d2731fa4f3b70347388e2308e9e43bdbf952465393",
        "d8d232a2c995a6ff133893dcfa9b559c11376eb999abf55edd51cc5edb7935500f80f55ca1a542a1b87f6c8c643b83d6"
    },
    {
        "P-384",
        "9fdc866600017ee5be419ef11f13a537a403ed16743d16d43fba9938893fa9771c20b971faa4719744cb40af3b73bf84",
        "315ec7497da462a6bc8fd16bbe9c84c7d96e8b9a49d6ce72936ef3a55d12c73e43f375a2d49015d8990eff598f3e4621",
        "8b84927898f8c79e8e5a101329454fd15b6333475e90e14bca1668323f854b10a2e95aeae619b4f68801ba3db1840a36"
    },
    {
        "P-384",
        "dc6dc5ed9ee57eb5e39878f97aeac359f8258b9c381fb1987abb061184013220a76d667fcf3a53088eae8da3f8d9b520",
        "285d0daaf8f6315a05fde9e6ec2f1d6ade8ab158abd4a40995f34a749421a2fbb0a642031e1be371b07931caa41bc523",
        "2920820f7eaebbd05ac5920d2ebd3561c12b635a1454476669a2d09b31fca66f883dacc2eb4ac078d203970d49a039f3"
    },
    {
        "P-384",
        "0f4144cf327d6feae06091d4a8c710011ce32c987af1451fccc471bc3f482bc741368e88d04324c93924dcb3b5274b02",
        "b8880cd358dbc4d8743b6bae8cd1296235a78720bad3c8786fa5db6a632ea82320cc705386810fa9b49d1c9c8164ba19",
        "03f930af97df0862640f1b9116f3d253c39180a34e3cf18fd54178fcad835ba1c4eae2f02136748bc57cde57e4cedb99"
    },
    {
        "P-384",
        "c5099dab8c2e1914bc37331f288a8d35d55e6163a6553dbe6a4fbd60311478ff9502a0efa3f2ac5ee6705afc443bcd39",
        "1f6e499ddca491b6e5da6e34eff16847284e816443cb9699f95e1449cc361327fb244f780cd704f55c1a4112fbda1264",
        "7b60b9f805598ca6a9521e5ccfd8e2c988fc450dc70f26202dd8567ef038f51e75441ae7b97b0debe3a2ed4b0442533a"
    },
    {
        "P-384",
        "86feaa8de26a91e4684c6f06689d4cf46ddc45ba27403a980107c0d31a5b675005fcbb7a07dc28ef9ee8d536252e0624",
        "c7d4b2b050813accbccf6abd5032e549126a9d31cbc926695506ced640a1e8b7bf27649ca4b255e347e4f111b208d56b",
        "fe14fbfb45373044431fe35d3e781bcfbb274e57b886a0922a7067de34425312879bfbc9a9df7a833d0e4f8f8180edce"
    },
    {
        "P-384",
        "f0d9c1fb64733c4e91e4129e4c0ca6879e25dafd0b583bc5d1d989664e592e52390494fd65bfff76b2a46fd7db23be47",
        "ca2a552a6151cff2651f62ccd3f859dba9888f9762423e780d83824777e99356c785d5c720e78dc01c3b0f01d76d1627",
        "0cc8da46a8267f0b4008ff48f1cfaffd03164d9234fe5aa85bf3db31b2cfb89595a3de2883b9ea0c7bd95d6f507b2139"
    },
    {
        "P-384",
        "3512b88c012aee202b5122353c610be0ef2a0604bfec2a6dfee7f1a80395aba6368029c388d462c53c24b5ec25055bb4",
        "fe79a325e7d410a5df04913bc91ad3a132b928679d4050226f1ad98a8caf473f7ed0b7211639f44c90deb2dd88937103",
        "69856bf3d2ce4388ca413de5625e050192552b1224234ad7ce3e71f23d164d83dacfac06b31d577a5860119c71c036eb"
    },
    {
        "P-384",
        "3a7b2a6a03c92154f4ef31dd257bd9d3397494da4c93dc033a1c7925a295ce12412797ac995191b665229ad6db881e6e",
        "9e248419857ca4a03c1f2ba99eddad34ce1904ba486c73e3903adb7fc5e63a6d397a9a1a5e06f1d62d78cb7038a518d3",
        "86a15f544ecd494b6c8cd5f561832a2d73fb83d0a8a76f10808022b47f2fff1e8730c43684ad17b6bd049c586b4d3cdf"
    },
#endif

#ifdef DO_TEST_P_521
    {
        "P-521",
        "184258ea667ab99d09d4363b3f51384fc0acd2f3b66258ef31203ed30363fcda7661b6a817daaf831415a1f21cb1cda3a74cc1865f2ef40f683c14174ea72803cff",
        "19ee818048f86ada6db866b7e49a9b535750c3673cb61bbfe5585c2df263860fe4d8aa8f7486aed5ea2a4d733e346eaefa87ac515c78b9a986ee861584926ce4860",
        "1b6809c89c0aa7fb057a32acbb9ab4d7b06ba39dba8833b9b54424add2956e95fe48b7fbf60c3df5172bf386f2505f1e1bb2893da3b96d4f5ae78f2544881a238f7"
    },
    {
        "P-521",
        "14b967f6651b5e6a482fccc609ab6630b3806fe1f94f4083319b0b50575fb3436a04f508172f7fc396d6e969ca3e8d1c1e9a84d431a48b94f30566dc6808dd1d138",
        "145f371040d3d4a24d6d3ceb2681db207b77096ab57606d92981a69ce35a0ac4628c2dc1284e4dd9715cde46f18b59e9fc98fea162ceb6e2c481ecbfad4e19d3abf",
        "125eb751ff4fb8bb98e1fb455d2cfb35e3323de5c7280fc9e51729704f4fec51d5a6ce6c1f75dbf710e1f9d3ee9f2a77e7c12c045e729d0e9a281c37f0f07b8cf0c"
    },
    {
        "P-521",
        "07616133442038e27357db450c353bd11fba3bcac8b7b8c3ef76aadb5fe05be1dd57a22d42a5444d00dcd018d389170c54fe781cb21c36020f657d001e1cbb41dd1",
        "0bbecf65446053080cc1cf955938c58eb630c84ecad2756f93b47ebfa9f9bca3fa8343539812608cab2d3a9f8079ab8311a4f269b0a3cd9e0ddd066fc4121d92f0e",
        "1dd96db411ad67997b10d42c76b8510c8a930dfa9a5927ac274b0c5021798690777b8e77e6ae2648bf513e02f586898e7dae20d71d19838a9f3175f06b057c5f2f4"
    },
    {
        "P-521",
        "13bcc0ed286861d3f5463bcfc0b68a6ec0fcf86291ba41257838b72536ada986e43e05ec4c32c0b29da632dd1ce39efc81c8278f5d18d9cf27f6e75523821a46d99",
        "0a3a165c2bb535d1041d54b749e2f6e6c734a03c09df69c14a5dd2aa57790acc504548885f0bd3a44f8b66bb9c36b3ff257d7d465efb81445d4cc5a5af7f36c679c",
        "08a5d094e4f2aa18fb877d2649dfd76f9482ac2e049aefbb463f3c9061cfdfaec785df9577a090e45a17330f422fb16a16acccff9ade7b034ec544c7a8aea441c49"
    },
    {
        "P-521",
        "1f79977450ce5887ae2ef7d648ab658c056e57f0a690cf28a4e94f373f2c15eb3c0d3e0d670feca6ff02d5fd03187146eb85e09d72f8cabb1900d0c338a23080c12",
        "16d9ede24a3950098798766e57c53f2749cd0d3f56ca0904a3711c030965291edd5c6fe0903771768f42340e88e1cd2f161358972775fa53e5b87c3b660acc447e2",
        "10ca5cfe6df8e069ae1326dd9e18cca75cde7cb24b427a409025f9e12b5098a56a20bb90b1d23b75fad7a54f9e25ff892e1236d1717f1f94e18fa2289f899fe2221"
    },
    {
        "P-521",
        "09a9160d2614937c33284627826be871c26407c84d23e6d23de5f5f48b500b89b0bc07f10c4e0fb99c085d9e9d7149278f76e3fae4abaeeef2495fe3d228ef0f949",
        "19ed72e6bfc673f2a852acf9d60e2c3b19c50a56c54ac304612b26f83afe1aff4f87dca458e83b6f89ec48f8b1a20931acd3c97c71bf21b5633cf4fd68437db45c1",
        "0d141dc4272ca03a528ad8fdade9ecb3070fb2d4af0bb296abdaed651b5d26573eb4443a4d0d4134ff248d8ed402c93bf6a905cb2792b9cecb4aeb69ed78f410382"
    },
    {
        "P-521",
        "02fdc02492573228ada3fa8a2db68d72e9396a2bfca9a8ebdb5c2955cc894a7493cfae001759368eb8ffc3c29b15365f6484cdd6a44e084f1d3c88dba7aa4f29c3c",
        "10ba48733fc3e8f54f601f74659bcd43fde4cf8c5a07da341ce68e792f8f70721c23dc6d9b1b401bd3254c8de546e9367f10aee947b1dd295e6d822524546ddc195",
        "1b2c0ea5c4171cdc069fc6c69e18636cfa404f487a143b3981a1f212969cdbd6601a84302867f8a4a4730fdcd0f994c226f7c02c5e664b79c34b7e5d071423ff528"
    },
    {
        "P-521",
        "1ad69406c11c66fad5fe2295f0e526622488755ecb18ba12ee51fa879ed47ff5f5b05195a821e8d36489492b5de2009f303e17b9fdf6379dae52c0178a16927ca38",
        "1f1ca24041ba73812c1124e96454545c45ab903407afce3105108362ed3cb4f7d0d5b1466074c2ef22c7fd1ebc16e74a74a163fbb2f530ef44549dad81e806f24d6",
        "06b34d6eff12bb76aee9bd7ac590e437735ae77da4a60191e8e01f1ceb8ad7c1eda4d0f84d4ed2dc72de702d351ef8f64b2cdf2a95ef185d3119f276f6ccb3c5a65"
    },
    {
        "P-521",
        "13c41b6514c608a2e4696cfc6bd2ddd36611ca5dbf6f2d2e3e32a1925c5ae4ff591dcaa75c4e8043adcb99d510cb664868bb638a2c52b81bb240a974548a68fce79",
        "0c6d82f16433c71e37f2e9779be4599a3b1dda415f6c338e52df4ca70607a69637b50170f21bbb7f60b9a9c145bb63e6d4f370fcd00bfb60f7a0dc55cc44f65fc90",
        "152344d6f2e72deb2c59ff2ae268fb067279a1942ae231734ba980c5457a6a73bbf2b13343ae44a0c8a712572851da4b91065ee0436abe811ae71883c4a2f1b797f"
    },
    {
        "P-521",
        "0316e2d06fd00c9c4266ea20bf60cdf867859a6f5ba242de35054cdcf5486e5e344ab1d1bce13e2cc831137320774ec3ab0f6fb554fccec56ada267959794898028",
        "0a183880e61c6e0435e591694e51f63c099fcd5b61e3ddacc4057399afc6a90321424ab0ec1699aeeb9c404616d62c23466132b52583c18d3530116b58ad41452f0",
        "0191e06057e2282b4de6e0741fb37b04f0e6ae172be81267b0db3023e7a116ac5861decd54ba84e15d5fd64d6ca628461b79e120851bed1c74adebe3ddee838a170"
    },
#endif

#ifdef DO_TEST_K_163
    {
        "K-163",
        "28a7447f95b43c072722ee52f2a68897518830272",
        "72dadf24b00f9a2a0ad6fbfb9d86181e939900174",
        "4bc1d4987dde0d2f633df16d686e2a78d6d3f49f3"
    },
    {
        "K-163",
        "0531a4763ae42a8cbdd94a161106fb13612927a2b",
        "23fc0cddf69c7632579491a662140091e8f0d52a2",
        "35d185ec26e0798d34fa159888a9e8900f7e3404a"
    },
    {
        "K-163",
        "0fd6e6140507223be2b3d5150ef109905f16ae30e",
        "437503edaf467c562f8d1393edb39b035d441d502",
        "6c9471cfa26d3d6575948eb100b98d1918bcfca91"
    },
    {
        "K-163",
        "32f10075896bd0b897e3669f97919e1698c00b02a",
        "66f7e162d40b64f94dc9083d54ca07534d17753b6",
        "29fb051ac51db8ac7cce3ea96de987cba4816414c"
    },
    {
        "K-163",
        "1a9c44a45e77930d2df4a598d97eea5f7acc0ad97",
        "6427576a9d879fbd98d49e97e53e73c239b5d0321",
        "510d7d01464b77dd57e8dab96aaf17868c44b87c5"
    },
    {
        "K-163",
        "15e971234b87deb346766eb0c4df25e5ca9af7fbc",
        "1f9df5cc6f7c09fceaf8b178145acea37d998708c",
        "7309ed6d5e7979e7a1569adb75085e1c99b9c558e"
    },
    {
        "K-163",
        "1bc3115bfc92eddf0e9c81fba39628c9a11c22a2e",
        "3918e2a66bbc6784ad850a10a1c009a4223d7b707",
        "006663b9fa095ec3beb611c07c2c4e3461914a1f7"
    },
    {
        "K-163",
        "30bc9eda64f264daa856cab7c7e2fe3504a8fd9d6",
        "3f0dc7b86afa9ab95880272dcc0f18ea649e8d3ae",
        "133a14f0d1a92a7afce571f8b2b10f345f47ca875"
    },
    {
        "K-163",
        "3542617b184b5bd9f445147b8e9a2b4e105d13b9f",
        "31aeed65acd22726f9453a3af911859857feabe9b",
        "78cbbca1ed6e966143d81bd367748356babe85d9a"
    },
    {
        "K-163",
        "371e9548d6c363cfa09b19ec61a0124c887574a73",
        "7ef17184f628f098d4b90fe9c6745747252188ef4",
        "1bf249d062ce773dd15ad2f3a7e7259ad1ad837da"
    },
#endif

#ifdef DO_TEST_K_233
    {
        "K-233",
        "1da7422b50e3ff051f2aaaed10acea6cbf6110c517da2f4eaca8b5b87",
        "1c7475da9a161e4b3f7d6b086494063543a979e34b8d7ac44204d47bf9f",
        "131cbd433f112871cc175943991b6a1350bf0cdd57ed8c831a2a7710c92"
    },
    {
        "K-233",
        "530951158f7b1586978c196603c12d25607d2cb0557efadb23cd0ce8",
        "0d37500a0391d98d3070d493e2b392a2c79dc736c097ed24b7dd5ddec44",
        "1d996cc79f37d8dba143d4a8ad9a8a60ed7ea760aae1ddba34d883f65d9"
    },
    {
        "K-233",
        "1f4f51efb07d51e8cd011174bb21e4172e18219613733e01da457a19",
        "0eea156c414e8337aba81efc4d42dee80370fc8010f71791ba0f78e8ecf",
        "0564d0ced60c07eddddb86006912895f75c1bdc704e92b04c5e0e4fb74f"
    },
    {
        "K-233",
        "178793e0f153feb4a1c485b6ebaed29efc29d2bf0149e9dd2b4c63601",
        "06c3f94ee4476d258a8133e1cff1f428790e280ca7675c8b83f02862622",
        "17766a40add7f959bcad0ea3c2e30bc727a3bf89036c3921fe43c411abc"
    },
    {
        "K-233",
        "11a6561cb6bbd76a3321f261fc16cd8c7624a8ee3f010ce9c711bac04",
        "1ee5e75e7a8f03d83792ead47192b240314955b659c0d8369b3867ca02a",
        "115329913d36751f452c23870ad47b4cc00a1f4574d5a3ce4d460ce6800"
    },
    {
        "K-233",
        "31466d35c003c78709d8f4ac3befbadcc4b6f89214b22908aae52d38",
        "11647967e4e1bdf21df72d4dd3dc61bd1bdf4013e3773a21949293bc45c",
        "10fad532c25f2c2fd53bcb61ba5c92b388671177fa378be0ed4f2b44e69"
    },
    {
        "K-233",
        "161ed98d23f4b67a2e4ebc481f54c9e374a8c5cd8aa4f03c1507c6b90",
        "1dd350271fcc989b3072d2ad8f98be529b3d1c647b03e24cdcdce653f5c",
        "17a5536691ef1ff002ac4e571c0ecf9b8a265893ea48c70cd56e468d804"
    },
    {
        "K-233",
        "c8d749b578023674c7653a2c9e80051d917c375e37a24b5d40181140",
        "0496ce97f768aeb27230e10b9946d9c498e8cd7902dfaf2d13a1615384e",
        "0d1116d47c9846bc58f84b70c29e24f0a7bc2435099c4b1ef7738d00f7c"
    },
    {
        "K-233",
        "148e6d7b729c00f428d6a9c2033e8e2fc20dc6b5cabb4b36af6dbb95f",
        "07cf58637a38cc5e80c8566f23954d2c903de46d3645122d05cddb57bf5",
        "18ed4b370cb93fe346ea20067e3a75dbc85ccdebbdbf8cbfd09034d4b34"
    },
    {
        "K-233",
        "14848629e58428827b9a80a501069a66c08f0988f35a7599c1265a6a9",
        "06b82b32050a91f5661348ef7714ddb90b464734c4c1d1f54ed82e36cc2",
        "136937ac39e03e4f6b4cd317cee7e15321c4eb5377833e1ce88759b86fc"
    },
#endif

#ifdef DO_TEST_K_283
    {
        "K-283",
        "1de6fc561ce8c3ec9a7c03a51e0c61204991f8caca8c7b073cd07945ffb22c48c30e5d4",
        "21e41033585949f5bf30a73d935c580946c3f15b942b42b54e3397fc4115ee96bbbcff0",
        "50789e0c1dacaebb72d7fe27081b2048a8fac3a58693e52807b8c346930b5c4deb549cb"
    },
    {
        "K-283",
        "1d3a07e0a0b92952ac48279c3d31a59080ef48ced370f67a778f1169c9608a229b49f94",
        "186c8fef00e5538673712d077851557aba7efe7219e3be0c8b1ce07f01adf53165e46e1",
        "4544669a4035b6b8a83723c500d75eb0ed28ed3267204fc8473f08739eedbfe1178a4c9"
    },
    {
        "K-283",
        "1c2fbc74c3d25661888f4de21d403bc3f3a6aa0b2f96b31d51d390dedbedf1d91cd375e",
        "02cb4969bcd70bfe5161f093c754db941601774fdc2607609f33592d278f4bb9dcbe963",
        "47ff6166e245137d9bcf2a120129c301266a0b453ef16d09471693ba9b2e3588f5e0892"
    },
    {
        "K-283",
        "161e2a457bfd9850ba6a2b89e0398ea7701112c0f2dc737d54961113f971e7e02c31855",
        "53165ca6fe24e637727fb1c28abf8dc14b58864ace7262d94bc0fb018e104707d4c0bae",
        "6bb353c2c1cc915569f311a202e58a065d7c52e55b8dd89d0335cd7a2b84842fec48c52"
    },
    {
        "K-283",
        "13eadf9c656584a184b5cc48200537a8aae7e8dd5a7097381f9cd20c9dac26878ae7fbb",
        "173d2f21ad9f1a92941b5692af876fb30a894e8dacaae75d7267c35d14b4805d2819a7b",
        "22842e4960f41e46ccf6745285cf0f47ec839ba69260f66b64203d828eefca726926113"
    },
    {
        "K-283",
        "19afd9d7150a17f8e14f89283ada03dae3e63805ed39e56a6eb1549b483635e97fd3c04",
        "56c3681427bea33d5ae69e5959c17fdd33ba5ed2ca1c7c078121e3e44ca26d048dd78ae",
        "78c1830fbb64ca4f55ee282aca83589542e995bd95a271aec8a2e5fb6ecc34f5d4e9c78"
    },
    {
        "K-283",
        "1d03cb77c419c7af9116a4a6be801adbb14f45a5d1bc36cc67e4c67486bad56f8fe69eb",
        "3045a9521ab07d942729fc7016b9131ec0aeedce70a2d99b998a949977ac477ca4241f0",
        "74aa606ba774d4a0948986d881a156ed56a50f73f29593752bbf1cc129edd9f77819d60"
    },
    {
        "K-283",
        "14433dcff145444e09519912455864be40f893b080d08c4a88bce2c18ca4f4a488709bd",
        "3cdef2612f903f7e570c6cc699cdcbb161d366bfd291dbb6073d3c200b9cacdaaa8eee9",
        "26cce61fbee0609c665c9049543f0f1afa10cdfdfde49b0a46c8ea2d5f145e08722088d"
    },
    {
        "K-283",
        "1281564e786ad45779e3cd1fc0064cdd5c50b2f9c2d9aad7ab2699efb1c9e1229879bf4",
        "1d9375dd8962fa86363db0838ff7287bbcb11720d55faa75f5a5125d97b97671ecffd3e",
        "3da55ea1e0b75d308c0993357f3e61d102c2f105ac40aaadb027788dd8439781d97eaf1"
    },
    {
        "K-283",
        "02b575be99452307aed0dd790e34b6deb3bf50241cf6c36c178d8079af277b5422f9d9b",
        "0f86ae73f3298f5bbaa119d1dd775fdefd73134d9f931a61f8874ca1e1095fcc109f1ac",
        "4d3138aeb154569a919972f9818f4673adfa542a2f21b30a7094fc86a6ae1b262592def"
    },
#endif

