stanlytw/M2354-Crypto-Emulation/Emulation Code/Crypto/CRYPTO_ECC/key_pair_test.c
#ifdef DO_TEST_K_409
    {
        "K-409",
        "190c5a00374cc3254fdd421c8e52b0cb0f00317bbfb4153195eb6195557989b8e78b27df35c8f47bb4b4ee4608ea04f2adb72",
        "0415d296d3d421801dd4ef870cdd234220af52c896f2d8e70c368622167655d45ab7db524552f7aeb9c1159bcac10f24b9b1864",
        "00f824d69ec629e2dabd323cfc93992f253c901ada1427967e591ca0e0970ae7ed35e252159255a3bdbf21d09b0c7bfeb72626a"
    },
    {
        "K-409",
        "76805aa187fb0a7a2b89b425fadb656dd8bdec382113018971f14a139c50b5e97d92b6a21a4792326b7a357fe2d1c138bfd1",
        "177f555f5731069eeaee590488303b970de5b9f738baa83c7938a46110a2db0c256d78b607a12635a5323f9b09d35daa21845ee",
        "122338f32577f39f9f5dca19e1348c5d3b06435622cba7189f449208502a2e15c951aab273976d0682c61752ccd040f548c6ea2"
    },
    {
        "K-409",
        "62f9555ffb7a21763135828e1dc3b1acc152caffddb74fe1198a9443cef287a2d42215be1a7726f7b972e4e683a6c66bb816",
        "154013398be5f84d820daa6c42226030532df6d98ae4be32a3eda3ea7e889ac89c3586a82e2bbfe6b8f16a7fb0e6c70a11208aa",
        "0085211a2f28100db227e604d11cd651b56bbef60897eca96e0c16a1f50daadf430244ab036abba4e390bbf700c14bad5365760"
    },
    {
        "K-409",
        "11b707745a83b6a47c6d9e2fae4ec08e5077d27d306ba4a1199920186365ecf1c42e50ef3c7982eb9adc1195b4da5271380b",
        "139bd67106a9fc29b052ac9160161a9bafe1ffd4b3e83b5206f134d131d0a6027afaa236f33f29e58a52f323c5bce9e3ac35698",
        "1fd7de6ac673527bb4b977828b5018a9f32e29cfa018311b4e0c0b3c9c11695b25f376967ba1b6ca003463f86880b36e6f0b449"
    },
    {
        "K-409",
        "5e3d3e10e05ce9a306b41983222e311a275c4196d0908597d896073214a178199e0de0725315d3ed2cecc295a3c4ed035fd6",
        "0ad9c817a6acc372c800f21942d3ea6183740bd6530fc5c5aaa90828bc2e7cbfb6b1f3ad243de7b3e16817cf71577c0b1420bdc",
        "0f3969e9a127e833255101019e70fe6ca4b1acdf48ddd57508bf92df94d0cf58d5288054b33da7b1814c63c4aea5964b4361b83"
    },
    {
        "K-409",
        "efafc2b5bb59e8ec18f3051d1c58e64712ed005ed12cbcf1ffa799b1cd0b1cf9e0ea1b7028e5aa312e7e4ea752f021e2dc7d",
        "06969f6456d64b2ebd5f2d85eae921182290bf9d421aaf92c89fe318886e9cc882d93de827a190c8330734f97b0ec6ee8362ede",
        "120e5632f473a7d68a801973b923f6e38637e185cb29a976b86dda4ed2626a2e48a549355bcb5cf9c48a494feb39042f37cc75a"
    },
    {
        "K-409",
        "12d3ce52b3e65151663bd49d8094b53f5f76f13f7ecd7395d0a5802d0623e03aa09641cfe353bf64584febfb6272b1baa3491",
        "1fd037a722d28f9d1067f358575959856c49d380efdf6d9bd94cbe9e8a6b1a756b2d2b566ed0abc82aa4bb905d3f3cf4af1e9a0",
        "1593d5eb8592c170603d90a0b6296a611154efa9be8df537de554c9bf0313a49df3c07e872d7ea069ca35d2fa560774af2a125f"
    },
    {
        "K-409",
        "1a8d3a1005c89951c70bb9f9c6da03550cc5c5ebf4cf2bd1d9aaee8dc72326cb2b1ec7ed1e343f58ac01e7ce1f9528bfe495b",
        "09889e7533eb1a342514d26b7f73b02b66881bcf23d6ab26effb221f9dafe3b8c1a10962e15beee4489821942c34481f7d47422",
        "01e423b5593858cbb7482efe3a0e3d29be97efb6bfc33921185f7cbea2969fd5807d7ddef3f59c34727b0124e41e01f128de2df"
    },
    {
        "K-409",
        "b4d55a7c2b1482f5ef9965577e18e781167e2ff66fb77ea9b094fd8678942694a00bce24fbf896d44a4f50644c7c03280073",
        "1bf1ec59049a4dc394e9eec989d9ad9620324a793a92954db208c0eed224926fe714ba18cf3b7383dab2d4f81c4a0c530cda99c",
        "11b588d6b7bec9326f5167a89e15302ebe97521f17a5b29e55a8f3d8bb8b19f1adacaaabdbeb4a1ee9e197b092e11bd5c5f60e4"
    },
    {
        "K-409",
        "1426c713a0574f8979a3db80473fd6d014ce8d8dfe42d6d2e76d40bc07895a2138908456e7c06c00adf41cefaeafc777139fc",
        "03bf8bdf2b9a68fc67800d5cfc3a208e9c014c41cc9060ae2069fa8df492b55fec7f3b4ceea60a0be975df24cfea400c8fd7910",
        "11bb78a652d7e43537a451c853750f53f25f698c1c4013c1b1bbe1db860458fc12d755d5c886bab46db10629567eb5e2d24cac4"
    },
#endif

#ifdef DO_TEST_K_571
    {
        "K-571",
        "4b7223994f77708dbefe1e76fedb6279710b8769933f87d12d4304bac646fc453055632beb70f87c6bcf6f28fcccba25088789d1f15013f25320ff09321e921eb3e66b0829e87c",
        "23691a3028fc2ea92f707f13c61953ebf411a247739f225f21878fa786e416c5aac32a5d73368bf3ca350f1e05022d17093dc318b42e5fa7234e32f959f20146da2165db36230c0",
        "0fd2635485e32d637bfd8f53ff600b9b2bcc6d79884be54dc50103e25c460d41c8d502d7927bb19adfb2cd59a83ec92f4186ac5c75014d3946f4a2a725d3324f6dc206197d19d79"
    },
    {
        "K-571",
        "1ad7816a8ff60e09c62a71b87021bbacea524fe75433b16018c2cf22a553880e1951d266d42c1570ddb84b0706c915e175b5436f4e20af5ea222d4257bbb8e2b003c0607d711797",
        "35d67a0bfce2fad2b9910addc20e9c1956c5180827f2e0d3f595190bc13786e7c9a26b04bc10f47f713d9e8bb8e9d9c14989fd628aff481cdfbf5e5aef0dca7847a46759a57300d",
        "5f1d0e1c5b5ab5c2afedc990df85a7b0a3ce5042b725aac6654eeb0419826d9508e28d6ffd3dbe0a10b36a66b87ce261c1a0b84084c27b323cf04af9526de9820d9e6d6182a0fdc"
    },
    {
        "K-571",
        "78c55b165683df3d44e66eacc650cc56069b4ad0fb267cc1fb30c026ee6ceded772b527458e99252f5740da681eb9c82cdd9efc57614aa448e9d2dae48e0393cfb028591cdc03e",
        "7a1e3910d02ad1c34159b890cdad01f745f5e0e8726b632028b009ecc8073b5d8463960b3310ca83798866f8f025beddfde8019cc4e66cfcba6f03453368daaeefcb4fdc1ea4ac1",
        "585981805ee26c54baeec9fb737d63e083b782275cc3a842425c2765f7898a498b010faa2a39a39bf775def6e868a6b108f04009d974df3754e9a951b39eb0bff4a6ec4368e4214"
    },
    {
        "K-571",
        "6e39ac963f8e9bf96696e3cbea0ab6f662d5daf19c82997f6aeb4e504995608b886cf1ea6c594ab6e687ac31cf18162f7bf1e50b02ce065e5988ead290326c2a0192d01df5eff2",
        "081e918c5848351b1e0c0dade53dc7fb3885f1c6a8f68e425647cd6dd6c73edc4ce14ad8ff3b4a2bebdf78c27cfb98fb06904a727d3bcf34fc814c62a1aa5d63e6f2afebb995242",
        "40320708ecdfea454e5717545c0a472193061f430999cc22b683066838cbe104d09af28ba04e266a426e09d2be8efb0f5bbc48dbb0c624ddcfe930f7a0f1cd5bf4c41b9e8113688"
    },
    {
        "K-571",
        "1b6ba172591a2d335eea7bb09e3ad2b702134a774b2ffd2f9d79fda5109bbd20793e9d4a589517446728b28b6bb66bea19bcb6c59c5f1022e84bd28752751fb4795610e960cbc2a",
        "1d0996f7d3e28f04a00765f4245541af170934b2fe2ed3e326460e8f7ede9d1a37298ede1488269a2e2879cc6f6f95fb2d9b0acfbf27bbacefd15ac1624e53281ed3c6ad16fe958",
        "4348b619eeeff1de1e67c69ee87fb2f6e0be04a8a22b8cbb69534bb27782b84cd27be619021c7a1d461a4092a36145addc7387a35eaf9ce2620e009f35ad46390cd12fef514c303"
    },
    {
        "K-571",
        "2ecf2555dc100dfa0ccddd2ab4a217a1d43dec1692f4b1a6c0f45aea093e0c25b622a8c9f17462e60436ebf6d90f9c820aabd12fc76e5ee01d585b99b48cd9f354a5290a39c3c0",
        "1ed26ebc98ca4bfb9d35fb1d58a0e9558fc61b9daf88f0d1df35265b1f722c73f817a1d27b0cec6699a450f7a3758d0d0f0dc08d1fa974e817e7bff846b109dc53953908790848e",
        "5e77410e400aae222c594dca669849917c955bc3d2e38e748d927035dfb24ea794c7fa68c778f900d6340be3240ee5f3a669d7189ae1f1592548531bff07415032c496a3b938f1f"
    },
    {
        "K-571",
        "74790bb379f6ef4de268dd5e922ec51635f3d8d40e7aa97703a9ca0204554659ebadef792cf4c9451a689f9d727e318ba0fcc9f5f7726aa7104f9ad9b62da0621e8fb2eda5aace",
        "22151a5b868c2ea727e81f2b640572317156fe79806f8603e01921c1b2b68c4165b31a2847e0499d88a7e8c368a99f658d751befbdee6e3af2e4ddc6a8b991bf0071939abfc8a37",
        "4371242b654814397cb99b810dad6e896baaf0a5f2112fc02959af99d03756ce789f4bc6efc3ea27e831fe60b60a822a3e805e7c81d4ab1b5124b1a57f475ba11d91f15d450389d"
    },
    {
        "K-571",
        "1b53297bfce00ffefb9b4db12a30a69a1148c9f6596cff23e636890db402f2d12c35d86f227d331f5022886b072cf184b2d565336a156a67a4a6f7067a7b21c465d22a9d04d68fe",
        "1a82c5ab0aef3e9bc3778061b74da36dbfdfb64e9eea90bfd6350ca73bfa66947ca31c5c33646b25395e12fdc3aac35e4c8c7f76219c229d7bbb1269dd77e83b26f78c908620800",
        "5b3a9946b247b9ccaa5b9cc9ad09f712c8581fbcb5fc0ada573830098edfec1ff9bc59249c6668673e6a14bed93f022ee5328e3a844f9b9a9848ad37a1fe5d5d25eaa950f6d1319"
    },
    {
        "K-571",
        "6e44c884dd6a5ca8ef943b74ed70fc9f3e4aab2337e2998d5a508bf4b959de4d77d7d9aa2d57e99245ef9f4263803257401deace9c0903db2de9666fef39b27c0862795ed0d8ca",
        "0ac8dd7a2ae93d85174d9f167a8c2dddf6d15de5519fd41bc8242139f14fd117ec462a98cf7c6136c19ab963707fcb34347dd3118e455afe9b0bbe8d97bcb640808e022fea13976",
        "5606355a595fdcdd6b9017d68b7bf40cd4c67f6cfdb33f6212dbf1d8a29b8290910e4f81e3fe0ad55ba03e50b076d8454bca42c7c2168f923824698ed2d37cad2bcc44bdd4f5c68"
    },
    {
        "K-571",
        "1346ac38db98038bd66e4bde353d5bcbaf628dc6bf5d4f046cf94f24295a187bd8b24e6d3e979c8d1063ac34a39b018c1644497b041406932ca605f690bf315bd60835a1e66049e",
        "593d8291e4c2b2d34caa4a788e9fec299a2b4b559d60179a71c1e8db27c46a9203a987039dc399f71d247a4f3dbc6dda7621f3ce87f7c8f7ae221c5dddcda3e53dd94957b0c93ab",
        "6c7f16fca076d95671dfe5689e5b715d1c8fb5fd293fef5d38a25d4d976de25462e41367468ecaae68d7dd3e70d4341e8c3a871afd09a300eec30bfa2997a899ead14b7d34c368d"
    },
#endif

#ifdef DO_TEST_B_163
    {
        "B-163",
        "25d594310681b01fd63333cdd4315e54e18fe2623",
        "07e7162c48dcab690aa9ef76d2ed066cedae33364",
        "08cc32f4b5a88985c6e0c418e4abe988d5375371d"
    },
    {
        "B-163",
        "306a58722716e0013fc1b0400ad4a46b664d89288",
        "269e6231a76ef19dfb51b2beb8d38f6a702b8fc16",
        "2adc145f674f95c920962672aa00708a2c12f5461"
    },
    {
        "B-163",
        "4d6a11276237fbb1bd246fe7e6e1098d39b7cfe2",
        "02f36f4d7e6b211bb93586b360ff84608d57e43e0",
        "4a016289b33dc90dd97c1b63491c730cf456d9a16"
    },
    {
        "B-163",
        "2731e75563847c79674504c0dd1542aedf6536dd2",
        "7166ea4eee46252358d53535d8bb51c1a6a4a0bf9",
        "2854d98233b5b8c40db2862329e06a007027dc5d5"
    },
    {
        "B-163",
        "29a853fc117d1abcf84495e9136787fdf2c49d32d",
        "6d5bea90d981377f8bb854834388ee71e10623c2b",
        "4d754bacb6d40cc05acdbec83c1088b0e53961bfe"
    },
    {
        "B-163",
        "35c46e2607d17d8db84d7f7420141a43805e4a46c",
        "50568c9c943e3d7239863950ae4c61dbc5b076cd7",
        "7d0493c1e421ad2af13e1e97e18ee039168b2407e"
    },
    {
        "B-163",
        "27c588736162669dfc18bb7782b6c9f25fc995705",
        "4ae976ef48717eb4b07ccc0b545b3e0fd0ee44b22",
        "2aa634be4a57f1d783f6482c5224577a353c0c7a7"
    },
    {
        "B-163",
        "156110c985db455e9740bcea7aed7a325707979b",
        "1cd9ff77dde7172228b9e683526ccc1998cf11525",
        "350aca0d4682c221704550b1da8f850403466d5f4"
    },
    {
        "B-163",
        "1c158eb2c071e9513ac7c864dbbc95394949978d5",
        "46e9e9defed2a8301e4ab7929838f15f3ee4abb88",
        "592743328b4dcae86ed77edc5a34902c1c7205d2a"
    },
    {
        "B-163",
        "21f43d47313dd20f1065113a4dc2ed4c607969c33",
        "51ea3a8ef4e33eebfc2b0bb975fb6d38602c55a77",
        "13108049c22f4126a1aee22f587d6452abcf0e93d"
    },
#endif

#ifdef DO_TEST_B_233
    {
        "B-233",
        "1e0da3dca621aab89a54e9528937ca7567464e6e783357878c1ecef15c",
        "0bf1e4d6ad911b7d4cfdfc990132b1e23bd279f4692bbac82e9e8b80dd4",
        "06c2a7599c395b8cc01b29b33ad6808361a7417d0dd7bd478a4a4783446"
    },
    {
        "B-233",
        "385646c2414546e7f23ffc81a94bcbe23c009c70d05ecde55ea04d8c57",
        "1c288fe1af99a0edce2ca4f3ab0411d4b2e451f91844e437ff5b980b552",
        "19c9ad89ddbe4c29542c86169ed56444862a3560f899aed46b5cf0aa765"
    },
    {
        "B-233",
        "45620dadc847f7d3be963065c8086c9df4747e18c5113894117b99cf80",
        "118f9424c338b8a3e877871bd8d7ec0de57733f5d9aa2eddee59eb1a8cf",
        "1f8351d555740ced5f405beb5dd27e57abc54fb7bc58ce22e25746a3223"
    },
    {
        "B-233",
        "42c9cd6477886e92bbdf8d758a2fc5fb24462f2f170ce6d462459d3f4e",
        "1878cd214ebe25de863908148a2436ff1397f5fcfb0d69f99d12b4d439a",
        "19b6e701a0e4af7e886656eeddcadde6d97be07e9e5cd33b27127175cc7"
    },
    {
        "B-233",
        "cb1825aa49ec13e20355b11b2da296c8f36af541b2ea78841cc24246d5",
        "0633ac65775994d1eac9f1008bdca4e4c22cd9e4face1ad9b23f14994ee",
        "1d9169a4450bb15a6644823f4db3519eb50d0fd7afe56ddaf78e3be3ce4"
    },
    {
        "B-233",
        "b5e0f0a59690abaafb8b3f04eda966134e57efdc75966b0f911a98f5c0",
        "0df07aa0078b39cbb5039aac34364a9cfb09da4bdcf48c37d2f94d5a5c7",
        "048aea204d38d94ada7fd0ee90f90679601871b0cbca141778da1a363fb"
    },
    {
        "B-233",
        "e5638e92ead50f50beb0245869be62d0ffb4c6220eae4672d07c39759",
        "133f68638d62cbda88605766f8f0057bf0b57fcbcd8b229f1751e87c8b1",
        "0074334470c85994b7f3a89c48d5eee5a038cd7b2a424277665fca5e31f"
    },
    {
        "B-233",
        "b0f0606b8f6774021e352f294e247c84779b33560e80bb2a5777390ad3",
        "13f38fb55b7346da0c329f0224ff443ff6100a1a187fb1904877141f013",
        "03dfa911a14d2bc53644462cd694ab71afebe39da968dda84a622e583c9"
    },
    {
        "B-233",
        "e50b9b47ef36fcfd228665cb1c6d6bf246d9eb2ede15bef69603a2bf5e",
        "0665d2b3e88eb0e9ca16f47291f5cf0966e5f2371e4a3172a56db07e439",
        "0f19c9d73b62d04846b6fe9cdb30cdd2557a523ab2028de55e9791f5339"
    },
    {
        "B-233",
        "ac5ea1dee86fb3b3ee32980fda39bd0f6f348c483b1f5cc5826afe45a6",
        "11145683943067ed54ef8d5731d779e6c1519d23ebc6b314a3c9b9970f0",
        "040c6b32eba5acd4194eb36260274ef8abd3495e2b119b2df1bb71b62d5"
    },
#endif

