stanlytw/M2354-Crypto-Emulation/Emulation Code/Crypto/CRYPTO_ECC/key_pair_test.c
#ifdef DO_TEST_B_283
    {
        "B-283",
        "10d57c6f40baac97852771cee44a04137fb0ae504df7d6bb4153e5f13678f511520d47",
        "5c555fecdea33c76bbc3498a2cf3f64eda57f3bedc9579439162a736953d25d16ffb6a3",
        "08808d8babe945f2f0040f70c9f10714b8852179314d17f8f1cef8164fe5d1705e33eff"
    },
    {
        "B-283",
        "24b02d9f28b53ea45f3ee9a8a454aa3c9d80a8f4251bffe27af89e9f55c7c4663b9b435",
        "3b85ac47a28960b010b0306c0192c2fe9717e37fffabc5d8a8048aa2c6b4144ba3c0d83",
        "58aeaae013444ef5a172aad42a4d464429bfcb9b8b772ef12e5807d3df3a15c18848a0a"
    },
    {
        "B-283",
        "2ec1063d5f8a3c00a3f6479c9feb482ba79a790cf775a503c01e76e924413c4f500437e",
        "54c0f0be52271a6c6a38a9a9a8db90761dfdba39b36449053e5d899d24362b49ec2ab73",
        "130dce0286e91ac80e9915b2e354e3828cfa94cd1860c8f228738c5a1a7359862aac408"
    },
    {
        "B-283",
        "26cec33fc6ac8fbcfa35a4ae146443b5bae048edbf2706091395a8ba5f1192c437d9e91",
        "188679b1f6fb4b2fedbf2a465a17d44091934bc97c0c4f83a776c48ad836d9c85a90553",
        "23e39ab7adbfd7f3568283fc2e5be2a8022ee15fceb2ac1e5e2e11856ac69f70e476bcf"
    },
    {
        "B-283",
        "2c52fe2e5bfd6bd74a343144343fd072508423fee3218e7a80a3c892c5c2a2bb6a6c564",
        "0977f6b4adab24ac0ee256ddbcb0c704ac4344ffa4e2c51788c558ef21b1150b84f0957",
        "35dcf5a552e0404e7f09f3c52c24c015ad20bfda139fa1013cacda5d5cd686f3bf4a0af"
    },
    {
        "B-283",
        "337bda89fa867b565f8853cccdefaeef9ef43de0fc45abb5aa237ca4c38a08806364087",
        "0beac38506d5c27e62851a3b05f7ab4e8c61237cd077810a13a7dcb570e60766445a57c",
        "6c24c00840891e9175ed710fd3ea2f87596622b533271a4c7b43245d91a4ccf8ea9ab92"
    },
    {
        "B-283",
        "2e0abef014667159aa0117b118ade974ff81b175dd3cdd7074b5e69acaa61cb12873b6",
        "107e41a842e81d05f6833b83b556160eab11d0baada9c5f007b5a462added70b31d6bac",
        "3973472bde9ad3dab0c40d42d8a44a3d9f8a159e08f45a68d3677c1f4602fd0b60929c3"
    },
    {
        "B-283",
        "d9827312725907837a97c3e37f34ba977130845044a9b08cffcbf3ff4f744629030021",
        "1c99a3d5e80fb2d541d6c423840e49b8eadac3d41d3be0d99e0b5c7a825462099dd6440",
        "7c3a1dc9e163be0cd943600b2df0870334c8d23715162248ff4956b811584dab03927cb"
    },
    {
        "B-283",
        "2072c2022734f87cd1898af7759ba6679bd6a833fc14605bbb6aa6715ea95d1586235e2",
        "3b11d28274308b98b53f8f4182a679c2e3c5867f576c9530d77e274285d291b4c64f2f5",
        "638764b2b7f150a157a915228ee8b7805abeb77f13562b925f2df8616960c803b3e34c4"
    },
    {
        "B-283",
        "990e77f2a044b07c759c8636e4f113a61c54a18c57b3c6c2f3d3fd194e30b25370ebed",
        "23b68bfe91b27959fc6f10093c339f9fea11152d1ef6e399c0499194292328f52bd6aad",
        "1788a3078e71b0f408c357671bc51aee0c0ba95f333bd27a04149852310edc47ca5b322"
    },
#endif

#ifdef DO_TEST_B_409
    {
        "B-409",
        "ebd71c6f6a42bb485480526d916977665df53c198dbd027e2a36ddd4e1178bed069ca6758d0069098301e9ef89dc545ce9c691",
        "1fc79d655eb2f07e8127fb0857de31fadb25afc04ea340fa448d669439e7519a3487c7601875d1f3431d3707a5a36de3532408d",
        "19a4dae9a205ead5fc6dac8b84f7b8846667b1853d02bfd696115f266b380b5be63eb684a46fb3536f9c44ac33cb5aa32000246"
    },
    {
        "B-409",
        "fca66cf484d82a4488a82206dccba704ba5d9e5fa108621ec477be4a66335b304e51ee5450c8aefd4cd439d96e16318fbe52da",
        "025e67141e1c2ff409f9503246fddb4e5766ab51bb89ae0a77bf78fc51045aa89e958999267f290fa5871c0ef7934f078c9f755",
        "080baef227e9250ecd0481aa0e74e758ddd0d00f3313685ee960b90fa2fff865067ea0841762d12bba75d0502273991de6e264f"
    },
    {
        "B-409",
        "d6e9d2c0d04243cf8b5c7aee2758c80c7d77d68f4ff0dbd2c4f337d8cf2daaa60430b13c175cf8c8978ad4a1e6c9211fe86896",
        "05ad910709f9da75e147050ef3eb9e1c1166c2602342e82e532ffd183c4c93d85a3ea5e45c7ea24a8ef13210d28717c5be9edcf",
        "1fb51588655b9f941c1c7f66e16c96ae1c4dc42a53325304db44ad5c8b17aa48faf0d7974391756aec5c07ffefecd0faebaef72"
    },
    {
        "B-409",
        "dbb45abd5cdceb8c15cd944ad4eef1fc562668436debc25080340e2149bace1da2aa48efcd02cc03ad5326b8271d5167283d69",
        "0ca94ed7db1471911609d51b5dbcd3b9ca8e11e5ad055f9f23ec09ecbe7bb62ebbbeecb0d63aae8f13f345d60fa1887318d247f",
        "09ebd90f3fc959e85fd30c6e6f41e0b76293f8acbc7284027d32b2b99ed19d8332be4941237d9f0b7791ac582b6a7ceaad89bb3"
    },
    {
        "B-409",
        "da9c7eec722555e17c19c628cf12b57b430b58ac54400649274d10091c0a465fbe2f4d62875f2d5490510540f9f1a5d0b21ab7",
        "12adf0880d0630ae6b45776f54d64fcb32c3faef8ae0103ca41baaa1e5f0ff35d846f58594ac35bf161952c358ff5fece0b34ab",
        "0ff1241776b0ab91aa9cc9ace75fdc847e8603b9df27f1b458daefdea01b0c69544b43c230c0cbbd6906aeeff4fe6e0e16d6648"
    },
    {
        "B-409",
        "c5bd683fc26c21fcc59189150b277fe865e71f04b070f891843188bb106fa455362a7d1fc7eca609f5c648833c6b31415b3c54",
        "0e4c544212a25902067145887442cafc080c8ccf15a2452ba761c03451c19c07fcfa9bd9d923549543303419d270157d6f8c9f9",
        "029b5c91c47a60b899638702da710cec7793528563062373373cabe996af8c511c4b846a3ef8dc9cd7815477bb68ff0abb69f15"
    },
    {
        "B-409",
        "4be4f6aa20bd01f96e9338f85723fcf3c950174a0e5c5c36a3253db96987f65b0743ef6f2433f075fcc0af58743f6373ab7a4b",
        "1b8dc091569e714cc5701735b0454f04d45ab83211bb5ea4f52f741118be76d5f8d8843547a2058a588603d9e71e9ac28173c1d",
        "0f918330c72e7d918e26723ec3c0a6a500a2fc5e9c0b5f3232b7752f9e92d63702e2b7f0726a86b60216b65f9e712234952fb9c"
    },
    {
        "B-409",
        "cbdf2904d949e98219d1dc274d6f8f071862566327b536e952a508a33f97d365262aafb8ae763f23134f64759ecf0e1ebd4a46",
        "1037208b6e29be7e50c7bde210558c90a32f22da5d32e4462204d99570e946f558fabc9dfa0b90c1ad0a55422559c077e8f9d9d",
        "0c514a871423f7cac675bdf6fddb69cf0b46ccb5e8a58f421b2d0cdaee0b21f0b4ead93003044c1679cb87e57c24512c0c75644"
    },
    {
        "B-409",
        "9a449b1d41ab7eafca30d9ef250ef3497e20e4f16a35f1cf970a998efe0492714e8a3070e8d3c793324c7e2ca8fcfbd7f04c3f",
        "0dc075a1315905d44258abf7aa1000364acbc5b7b0954a284dbdbd531076d6deed8929331c8ac08f65058732847d6c3436fc539",
        "04be11c49d16d3585f6e955250d5833ac543738cdcad0d8345136aeb8a09be03cb7cc177bbb17f37e4722fdbee228567cc0c4aa"
    },
    {
        "B-409",
        "a5c7a53245d9ae4abac6c7578da3e22cf1397a177c0f51867f0c85dbda91fe24f2d279df5cbaab6137a698cfc3128814f8fd8a",
        "119710aa878df8ce730f150b921fd16404be64c491dcf03d21dc53284442e82215196b1792c819e06054c2dec022cf1b22e5d23",
        "08ad9d62bacabdadc4198932a0ff49756ace4db93ab6cd7204081f4da735fad667e48c9c1736adfe64030f03a59e0f9bda9cbb1"
    },
#endif

#ifdef DO_TEST_B_571
    {
        "B-571",
        "1443e93c7ef6802655f641ecbe95e75f1f15b02d2e172f49a32e22047d5c00ebe1b3ff0456374461360667dbf07bc67f7d6135ee0d1d46a226a530fefe8ebf3b926e9fbad8d57a6",
        "53e3710d8e7d4138db0a369c97e5332c1be38a20a4a84c36f5e55ea9fd6f34545b864ea64f319e74b5ee9e4e1fa1b7c5b2db0e52467518f8c45b658824871d5d4025a6320ca06f8",
        "3a22cfd370c4a449b936ae97ab97aab11c57686cca99d14ef184f9417fad8bedae4df8357e3710bcda1833b30e297d4bf637938b995d231e557d13f062e81e830af5ab052208ead"
    },
    {
        "B-571",
        "3d2bd44ca9eeee8c860a4873ed55a54bdfdf5dab4060df7292877960b85d1fd496aa33c587347213d7f6bf208a6ab4b430546e7b6ffbc3135bd12f44a28517867ca3c83a821d6f8",
        "7a7af10f6617090bade18b2e092d0dfdc87cd616db7f2db133477a82bfe3ea421ebb7d6289980819292a719eb247195529ea60ad62862de0a26c72bfc49ecc81c2f9ed704e3168f",
        "721496cf16f988b1aabef3368450441df8439a0ca794170f270ead56203d675b57f5a4090a3a2f602a77ff3bac1417f7e25a683f667b3b91f105016a47afad46a0367b18e2bdf0c"
    },
    {
        "B-571",
        "4d4a4b40f51b334b91d6d2f6a8678edcef19eb45273951db61e120704221cedfdb1c8a58846ffd74e79ab4f5573ad6a9bf41d283ab43fb6a75d92fd9d28201a2b3a7882f55487b",
        "0ea7e29653b65e920254f620c901a3acf373f36d843c394f1f89d9a6816e10f8656864d756e4d674781004497b042a4b233496157a8f534ff9a54f94e7ce514eee19758bb14b0c6",
        "1a67d570caff72718f32ba5771d4add7a207b0b19068b8ab3c3eb70d0e506306da152744e99f10ab0d5554c8dc5b7ce324654597885e0a8e2a6c96ba483999ba1cfe5e9ba07f295"
    },
    {
        "B-571",
        "27174a32ce22e1998319e17e2fd9530faf39a10ca06b7bc370095e83ec7d7a60bce8ae3add26d2913843c0be9cb34a60194b4f1c880866f8a60d1fcd5bf24f1d20de42afbf57ac5",
        "7a1fae97a343d910fe6965d22e99cfc35400bfb5622c2ed18781aefa84445808644f336e4cb523e26eda62a97756044f66452997d4501ac8b91ea1970d81df4ed46d1bea0253362",
        "6b58c00883127aa84f67335670ee991c802fd376944a78e9ca45d45b311c390473ab8a640c463858886cf079be2263eb4ce37cdf7ce32c9deb52d5ccd2a4576a4834eafbf904786"
    },
    {
        "B-571",
        "22ffb70337c186403dd4cb4638ad3eb82e2a4df4cc99fc42facedfa2036692649c8db3d9603d1c5c22db5c06c1fd77875b6185ccd422fb8815a52ddf259ee5a481c6ad5a024072a",
        "1e1b16db99f45ca36fef227b177adee3fb9b80565391314968e7ce1c4de6fa2a57df41ade6d4a2f6d5e5316a3e3e66134b628d0a99fb7f7890a6f47c858d7b0960908567f4cc0a3",
        "4e7bf4f161ac23e43433ac26cb696ac0f659f6a9e551613803d348f7f4f1b03b042b4a06b37bec324de552cd4adac429466589d2a8ae2274f47f4d79062d940d378fd8c592c0960"
    },
    {
        "B-571",
        "31d0ea20b3d8af4c93f1f90c811fd6697eeb69737adb6a69facdae702ea38fd61cd0693c0dedc8b362a79afc6718f9b93f923e44310d8e7207a3991c8eab403bfcb4a314729c10c",
        "442488e1f3d852b89e5453002bbddc33ca905ac53b50fadf33c221858fcc3635aff76198f52d525d5010555211b29ff0bc2318a1d8da91e258cfa2e843eb7b8f80692fb4f03f616",
        "1b4446769301976834c4848cc3147f423ba399bc78105801b2456c3b92d17c9611b69a2a5af287c7160f5334d77954ffbae8ae3adbeef8b9fd9274636ba53918eaec7ed0a035432"
    },
    {
        "B-571",
        "2319fb6c3638eec8457510caec30812ebecfae83030dbc50aaa7aae230ad24f0ab4d5e9fc40d12d1b331062c02fdf003ec502e57e1b0a67e10a2a088412066b10b28e3b6678993b",
        "7b91a209497fc1a456f87b4e596d057fa53401048cd064acf18224eec5f6aa415dac7e102c0b37a1403bbdbf89621b68711dfae1ebea6e4c0f0312ea8d16000bfd6981d4595a10c",
        "601003a3458df1dc2273623d8e911fbdefab65163978baf28fc2bac106b2b361f53e85569bb992663609c511be94183659fefa4e09cf39afbcf35ec56dbadce00b0d96c4eda6e5c"
    },
    {
        "B-571",
        "1ee42fbe7bcbb25ba8407ddbae7eac5ef9d581b70c15c45703b303130c3b03e0e2f53606079273dd5d479db32be98b8995735abaebc12064e9c8a3ef5953c5de4c924f0ad93a5a",
        "1c735d087ca33d79fa9e1634badc75b4488995f7d1bf46d3e11612c4cb11417f7595ebb2e7ff26d86bc18299afa1195fc4c5f3e66ab6b661066ca68b19ec499490ff6a14cc4c9b4",
        "3e2b86281dfc1925100e71da0a27013944796d50fd9c3fb1b4bbab95a2a3703e262ecc0b1be5562641a1f26768d475c538382db75e7e0da07c0acddbf03797111c36f477cd15cab"
    },
    {
        "B-571",
        "24afed7f4efeb56635b5cb19d86f585b5d8b96de6f0ec311dd273e2695f4c7e8f1a6eaaf78649a38d1d2025ee1702d8ff2c7a932e0aa41de4363235fc9001bfd76e615b5fe13619",
        "2c57de00be65e4388a53f93935c09a5938210d728e0d448f86f4fa4b7bc1a1cbe895b95e8af3964b9f7e01e066b9b982437b479161ec246f305a01061deaa0903568ddc32ce74fe",
        "1847f5b37038ed882d107f1931b93afaaeb28abd7b03676564326ba9f9e8e39313b39084f3a3d2193af8aca46d04477233b00ab9673afa0cdce7c2ace6bd1266c7204d790fc6871"
    },
    {
        "B-571",
        "2303cada41dcae911ed71c0c400d05785e6e53337df1afee3eb354454d1f858cd3fd3d4c2bd5c52ab5c4f06a907d53b8e4ec27f0a28ea92074f5d9fd549b0084066372e55fd0d90",
        "3d2cba6ae3197e55275bc458773a9861af355468c2ff55c521fc3e246cfd65b47d9c1186bf5fc363df3dbb6709f08db79dac8a52d77801bae08276beb8a8c8a16b237c3fa187f1d",
        "3a9ef76b92ba75eb59e116ab3521250231bb571923ac5f3ccfb9df3c23de2330e1e78627a26fdeb539774af92d9a79fc8839db0c3d5c5cb14332bf8b729caf2f9efe8cc77920ae4"
    },
#endif
};

int ForceStop()
{
    int i = 42;
//Stop
    if(ecc_init_curve2((char *)_kp[i].curve) < 0)
    {
        printf("ECC open curve %s failed!\n", (char *)_kp[i].curve);
        return -1;
    }

