stanlytw/M2354-Crypto-Emulation/Emulation Code/Crypto/CRYPTO_ECC/key_pair_test.c
    Hex2Reg((char *)_kp[i].d, (uint32_t *)&crpt->ECC_K[0]);

    printf("\n\nRun test pattern %d\n", i);

    //set FSEL (Field selection)
    if(pCurve2->GF == CURVE_GF_2M)
    {
        CRPT->ECC_CTL = 0;
    }
    else           //  CURVE_GF_P
    {
        CRPT->ECC_CTL = CRPT_ECC_CTL_FSEL_Msk;
    }

    // Public key QA
    printf("Produce Public key (x2)!\n");

#ifdef USE_DMA
    CRPT->ECC_SADDR = (uint32_t)crpt + 0x808;
    CRPT->ECC_DADDR = (uint32_t)crpt + 0x808;
    CRPT->ECC_STARTREG = 0x808;
    CRPT->ECC_WORDCNT = 144;
    CRPT->ECC_CTL |= CRPT_ECC_CTL_DMAEN_Msk | CRPT_ECC_CTL_LDP1_Msk | CRPT_ECC_CTL_LDA_Msk | CRPT_ECC_CTL_LDB_Msk | CRPT_ECC_CTL_LDN_Msk | CRPT_ECC_CTL_LDK_Msk;
#endif


    ECC_DISABLE_INT(CRPT);

    g_ECC_done = 0;
    CRPT->ECC_CTL |= (pCurve2->key_len << CRPT_ECC_CTL_CURVEM_Pos) | ECCOP_POINT_MUL | CRPT_ECC_CTL_START_Msk;

    CRPT->ECC_CTL = CRPT_ECC_CTL_STOP_Msk;
    while(1)
    {
        if(!(CRPT->ECC_STS & CRPT_ECC_STS_BUSY_Msk))
        {
            printf("  ECC_STS BUSY bit was cleared!!\n\n");
            break;
        }
    }

    ECC_ENABLE_INT(CRPT);
    printf("  CRPT->INTSTS 0x%X!!\n\n", CRPT->INTSTS);

}


int key_pair_test()
{
    int     i;
    uint32_t  t0;
    int     result = 0;

    for(i = 0; i < sizeof(_kp) / sizeof(KP_TV_T); i++)
    {
        if(ecc_init_curve2((char *)_kp[i].curve) < 0)
        {
            printf("ECC open curve %s failed!\n", (char *)_kp[i].curve);
            return -1;
        }

        Hex2Reg((char *)_kp[i].d, (uint32_t *)&crpt->ECC_K[0]);

        printf("\n\nRun test pattern %d\n", i);

        //set FSEL (Field selection)
        if(pCurve2->GF == CURVE_GF_2M)
        {
            CRPT->ECC_CTL = 0;
        }
        else           //  CURVE_GF_P
        {
            CRPT->ECC_CTL = CRPT_ECC_CTL_FSEL_Msk;
        }

        // Public key QA
        printf("Produce Public key (x2)!\n");

#ifdef USE_DMA
        CRPT->ECC_SADDR = (uint32_t)crpt + 0x808;
        CRPT->ECC_DADDR = (uint32_t)crpt + 0x808;
        CRPT->ECC_STARTREG = 0x808;
        CRPT->ECC_WORDCNT = 144;
        CRPT->ECC_CTL |= CRPT_ECC_CTL_DMAEN_Msk | CRPT_ECC_CTL_LDP1_Msk | CRPT_ECC_CTL_LDA_Msk | CRPT_ECC_CTL_LDB_Msk | CRPT_ECC_CTL_LDN_Msk | CRPT_ECC_CTL_LDK_Msk;
#endif

        t0 = get_cur_ticks();

        g_ECC_done = 0;
        CRPT->ECC_CTL |= (pCurve2->key_len << CRPT_ECC_CTL_CURVEM_Pos) | ECCOP_POINT_MUL | CRPT_ECC_CTL_START_Msk;
        while(g_ECC_done == 0);

        //printf("Dump DMA buffer: \n");
        //dump_hex_buff(0x800, (uint32_t *)((uint32_t)crpt + 0x800), 126);
        //printf("Dump ECC register space: \n");
        //dump_hex_buff(0x800, (uint32_t *)((uint32_t)CRPT + 0x800), 126);

        Reg2Hex(pCurve2->Echar, (uint32_t *)&crpt->ECC_X1[0], temp_hex_x);
        Reg2Hex(pCurve2->Echar, (uint32_t *)&crpt->ECC_Y1[0], temp_hex_y);

        printf("Qx = %s\n", temp_hex_x);
        if(memcmp(temp_hex_x, _kp[i].Qx, pCurve2->key_len / 4) != 0)
        {
            printf("Test filed, expect Qx = %s\n", _kp[i].Qx);
            for(i = 0; i < pCurve2->key_len / 4; i++)
            {
                if(temp_hex_x[i] != _kp[i].Qx[i])
                    printf("%d - 0x%x  0x%x\n", i, temp_hex_x[i], _kp[i].Qx[i]);

            }
            result = -1;
        }

        printf("Qy = %s\n", temp_hex_y);
        if(memcmp(temp_hex_y, _kp[i].Qy, pCurve2->key_len / 4) != 0)
        {
            printf("Test filed, expect Qy = %s\n", _kp[i].Qy);
            result = -1;
        }

        t0 = get_cur_ticks() - t0;
        printf("Compution time: %d.%d seconds\n", t0 / 100, t0 % 100);

        if(result != 0)
            break;
    }

    if(result == 0)
        printf("Key pair test passed.\n");
    else
        printf("Key pair test failed.\n");

    return result;
}



int  ECC_DMA_invalid_test()
{
    int     i = 0;
    uint32_t  t0;
    int     result = 0;


    if(ecc_init_curve2((char *)_kp[i].curve) < 0)
    {
        printf("ECC open curve %s failed!\n", (char *)_kp[i].curve);
        return -1;
    }

    Hex2Reg((char *)_kp[i].d, (uint32_t *)&crpt->ECC_K[0]);

    printf("\n\nRun test pattern %d\n", i);

    //set FSEL (Field selection)
    if(pCurve2->GF == CURVE_GF_2M)
    {
        CRPT->ECC_CTL = 0;
    }
    else           //  CURVE_GF_P
    {
        CRPT->ECC_CTL = CRPT_ECC_CTL_FSEL_Msk;
    }

    // Public key QA
    printf("Produce Public key (x2)!\n");

    CRPT->ECC_SADDR = 0xFFFFFFFF;
    CRPT->ECC_DADDR = 0xFFFFFFFF;
    CRPT->ECC_STARTREG = 0x808;
    CRPT->ECC_WORDCNT = 144;
    CRPT->ECC_CTL |= CRPT_ECC_CTL_DMAEN_Msk | CRPT_ECC_CTL_LDP1_Msk | CRPT_ECC_CTL_LDA_Msk | CRPT_ECC_CTL_LDB_Msk | CRPT_ECC_CTL_LDN_Msk | CRPT_ECC_CTL_LDK_Msk;

    t0 = get_cur_ticks();

    g_ECC_done = 0;
    CRPT->ECC_CTL |= (pCurve2->key_len << CRPT_ECC_CTL_CURVEM_Pos) | ECCOP_POINT_MUL | CRPT_ECC_CTL_START_Msk;

    while(g_ECC_done == 0);



    return result;




}





